<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [30]:
# текст запроса
query_3_1 = f'''select 
            count(id) 
            from vacancies
            
            '''

In [31]:
# результат запроса
df_3_1 = pd.read_sql_query(query_3_1, connection)
df_3_1

C:\Users\alexD\AppData\Local\Temp\ipykernel_3788\4045908245.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_1 = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [30]:
# текст запроса
query_3_2 = f'''select 
            count(DISTINCT id) 
            from employers
            
            '''

In [31]:
# результат запроса
df_3_2 = pd.read_sql_query(query_3_2, connection)
print(df_3_2.iloc[0,0])

23501

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\2302233375.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_2 = pd.read_sql_query(query_3_2, connection)

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [32]:
# текст запроса
query_3_3 = f'''select 
            count(DISTINCT id) 
            from areas
            
            '''

In [34]:
# результат запроса
df_3_3 = pd.read_sql_query(query_3_3, connection)
print(df_3_3.iloc[0,0])

1362

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\132933095.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_3 = pd.read_sql_query(query_3_3, connection)

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [35]:
# текст запроса
query_3_4 = f'''select 
            count(distinct id) 
            from industries
            
            '''

In [37]:
# результат запроса
df_3_4 = pd.read_sql_query(query_3_4, connection)
df_3_4

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\854197215.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3_4 = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [33]:
# выводы по предварительному анализу данных
# 1. Количество вакансий в базе данных составляет 49197, что указывает на обширный набор вакансий, возможно, представленных для поиска соискателями.
# 2. В таблице employers содержится информация о 23501 работодателях, что свидетельствует о том, что на рынке труда присутствует значительное
# количество компаний, предлагающих вакансии.
# 3. Наличие 1362 различных регионов в таблице areas указывает на то, что информация о вакансиях распределена по различным местоположениям, 
# что может быть полезно для соискателей, ищущих работу в конкретном регионе.
# 4. Существует 294 сферы деятельности, представленные в таблице industries, что указывает на разнообразие отраслей, где представлены вакансии, 
# и может помочь соискателям найти работу в соответствии с их профессиональными интересами.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [5]:
# текст запроса
query_4_1 = f'''SELECT a.name, COUNT(DISTINCT v.name) AS cnt
FROM areas a
JOIN vacancies v ON a.id = v.area_id
GROUP BY a.name
ORDER BY cnt DESC 
            
         '''

In [6]:
# результат запроса
df_4_1 = pd.read_sql_query(query_4_1, connection)
df_4_1

C:\Users\alexD\AppData\Local\Temp\ipykernel_14004\620650199.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_1 = pd.read_sql_query(query_4_1, connection)

                name   cnt
0             Москва  3894
1    Санкт-Петербург  2143
2        Новосибирск  1501
3              Минск  1497
4             Алматы  1421
..               ...   ...
764      Электроугли     1
765           Эртиль     1
766          Абхазия     1
767             Юрга     1
768       Звенигород     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [68]:
# текст запроса
query_4_2 = f'''SELECT 
         COUNT(v.id)
          FROM vacancies v
         WHERE salary_from IS NOT NULL OR salary_to IS NOT NULL 
        '''

In [74]:
# результат запроса
df_4_2 = pd.read_sql_query(query_4_2, connection)
df_4_2

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\3746829199.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_2 = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [75]:
# текст запроса
query_4_3 = f'''SELECT 
    ROUND(AVG(salary_from)),
    ROUND(AVG(salary_to))
FROM 
   vacancies 
        '''

In [76]:
# результат запроса
df_4_3 = pd.read_sql_query(query_4_3, connection)
df_4_3

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\3595259731.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_3 = pd.read_sql_query(query_4_3, connection)

     round     round
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [86]:
# текст запроса
query_4_4 = f'''SELECT 
    COUNT(*) AS vacancy_count,
    v.schedule,
    v.employment
FROM 
    vacancies v
    JOIN employers e ON e.id = v.employer_id
GROUP BY 
    v.schedule,
    v.employment
ORDER BY 
    vacancy_count DESC
LIMIT 1 OFFSET 1;
 
        '''

In [87]:
# результат запроса
df_4_4 = pd.read_sql_query(query_4_4, connection)
df_4_4

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\2028972612.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_4 = pd.read_sql_query(query_4_4, connection)

   vacancy_count          schedule        employment
0           7802  Удаленная работа  Полная занятость

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [88]:
# текст запроса
query_4_5 = f'''SELECT 
    COUNT(*) AS vacancy_count,
    v.experience
FROM 
    vacancies v
GROUP BY v.experience
ORDER BY 
    vacancy_count 
 '''

In [92]:
# результат запроса
df_4_5 = pd.read_sql_query(query_4_5, connection)
df_4_5

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\210463167.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4_5 = pd.read_sql_query(query_4_5, connection)

   vacancy_count          experience
0           1337         Более 6 лет
1           7197           Нет опыта
2          14511       От 3 до 6 лет
3          26152  От 1 года до 3 лет

***

In [7]:
# выводы по детальному анализу вакансий
# 1. Из предоставленных данных видно, что количество вакансий в каждом регионе различно. Пять регионов с наибольшим количеством вакансий это Москва 
# (3894), Санкт-Петербург (2143), Новосибирск (1501), Минск (1497) и Алматы (1421). Это говорит о том, что эти регионы предлагают больше вакансий,
# чем другие.
# 2. Только 24073 вакансий имеют хотя бы одно из двух полей с указанием зарплаты. Средние значения для нижней границы зарплаты составляют 71065.0,
# а для верхней границы - 110537.0. Это может быть полезной информацией для соискателей при выборе вакансий в зависимости от ожидаемого уровня
# заработной платы.
# 3. Количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment) также представлено. 
# Например, 7802 вакансии предлагают удаленную работу на полную занятость. Эта информация может быть полезной для соискателей, 
# которые ищут конкретные условия трудоустройства.
# 4. Вакансии требуют опыт работы разной продолжительности. Наибольшее количество вакансий требует от соискателей опыта от 1 года до 3 лет (26152), 
# в то время как наименьшее количество вакансий требует опыт работы более 6 лет (1337). Это может быть полезной информацией для соискателей при 
# поиске вакансий, соответствующих их опыту и квалификации.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [96]:
# текст запроса
query_5_1 = f'''SELECT 
    e.name,
    COUNT(v.name) AS vacancy_count
FROM 
    employers e
    JOIN vacancies v ON e.id = v.employer_id
GROUP BY e.name
ORDER BY vacancy_count DESC
limit 5
'''

In [101]:
# результат запроса
df_5_1 = pd.read_sql_query(query_5_1, connection)
df_5_1

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\1147638897.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_1 = pd.read_sql_query(query_5_1, connection)

            name  vacancy_count
0         Яндекс           1933
1     Ростелеком            491
2       Тинькофф            444
3           СБЕР            428
4  Газпром нефть            331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [109]:
# текст запроса
query_5_2 = f'''select a.name,

           count(distinct e.id) cnt_emp,

           count(distinct v.id) cnt_vac

from areas a

         left join employers e on a.id = e.area

         left join vacancies v on v.area_id = a.id

where v.id is null

group by a.id

order by cnt_emp desc
'''

In [113]:
# результат запроса
df_5_2 = pd.read_sql_query(query_5_2, connection)
df_5_2

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\2306256317.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_2 = pd.read_sql_query(query_5_2, connection)

                   name  cnt_emp  cnt_vac
0                Россия      410        0
1             Казахстан      207        0
2    Московская область       75        0
3    Краснодарский край       19        0
4    Ростовская область       18        0
..                  ...      ...      ...
588             Скидель        0        0
589          Белоозерск        0        0
590           Орловский        0        0
591          Павловская        0        0
592             Таксимо        0        0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [118]:
# текст запроса
query_5_3 = f'''SELECT 
    e.name AS employer_name,
    COUNT(DISTINCT v.area_id) AS num_regions
FROM 
    employers e
    JOIN vacancies v ON e.id = v.employer_id
GROUP BY 
    e.name
ORDER BY 
    num_regions DESC
LIMIT 1
         '''

In [119]:
# результат запроса
df_5_3 = pd.read_sql_query(query_5_3, connection)
df_5_3

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\133400711.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_3 = pd.read_sql_query(query_5_3, connection)

  employer_name  num_regions
0        Яндекс          181

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [120]:
# текст запроса
query_5_4 = f'''SELECT 
    COUNT(e.id) AS num_employers_without_industry
FROM
    employers e
LEFT JOIN employers_industries i ON e.id = i.employer_id
WHERE 
    industry_id IS NULL
    '''

In [125]:
# результат запроса
df_5_4 = pd.read_sql_query(query_5_4, connection)
df_5_4

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\1045119256.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_4 = pd.read_sql_query(query_5_4, connection)

   num_employers_without_industry
0                            8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [126]:
# текст запроса
query_5_5 = f'''SELECT 
    e.name
FROM
    employers e
JOIN employers_industries i ON e.id = i.employer_id
GROUP BY e.id
HAVING COUNT(i.industry_id) = 4
ORDER BY e.name
LIMIT 1 OFFSET 2;

    '''

In [130]:
# результат запроса
df_5_5 = pd.read_sql_query(query_5_5, connection)
df_5_5

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\4025176131.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_5 = pd.read_sql_query(query_5_5, connection)

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [131]:
# текст запроса
query_5_6 = f'''SELECT 
    i.name AS name_area,
    COUNT(e.employer_id) AS empl_count
FROM 
    industries i
JOIN employers_industries e ON e.industry_id = i.id
WHERE i.name = 'Разработка программного обеспечения'
GROUP BY i.name;

'''

In [135]:
# результат запроса
df_5_6 = pd.read_sql_query(query_5_6, connection)
df_5_6

C:\Users\alexD\AppData\Local\Temp\ipykernel_8708\2713946032.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_6 = pd.read_sql_query(query_5_6, connection)

                             name_area  empl_count
0  Разработка программного обеспечения        3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [5]:
from urllib.parse import quote_plus
url = quote_plus('https://ru.wikipedia.org/wiki/Города-миллионеры_России', safe=':/')
tables = pd.read_html(url)
cities = tuple(tables[0]['Город'])
cities

('Москва',
 'Санкт-Петербург',
 'Новосибирск',
 'Екатеринбург',
 'Казань',
 'Красноярск',
 'Нижний Новгород',
 'Челябинск',
 'Уфа',
 'Самара',
 'Ростов-на-Дону',
 'Краснодар',
 'Омск',
 'Воронеж',
 'Пермь',
 'Волгоград')

In [6]:
import requests
import pandas as pd

url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России'
response = requests.get(url)

tables = pd.read_html(response.content)
mln_cities = tuple(tables[0]['Город'])
mln_cities

('Москва',
 'Санкт-Петербург',
 'Новосибирск',
 'Екатеринбург',
 'Казань',
 'Красноярск',
 'Нижний Новгород',
 'Челябинск',
 'Уфа',
 'Самара',
 'Ростов-на-Дону',
 'Краснодар',
 'Омск',
 'Воронеж',
 'Пермь',
 'Волгоград')

In [36]:
# текст запроса
query_5_7 = f'''WITH ts AS (
    SELECT
        a.name, 
        COUNT(v.id) as v_cnt
    FROM
        vacancies AS v
    JOIN employers e ON v.employer_id = e.id
    JOIN areas AS a ON v.area_id = a.id
    
    WHERE
        e.name = 'Яндекс'
        AND a.name IN ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Казань', 'Нижний Новгород', 'Екатеринбург', 'Самара', 'Омск', 'Красноярск', 'Ростов-на-Дону', 'Уфа', 'Воронеж')
    GROUP BY a.name
    ORDER BY v_cnt
)
SELECT ts.name, ts.v_cnt
FROM ts

UNION ALL 

SELECT 'Total', SUM(ts.v_cnt)
FROM ts;
    
'''

In [39]:
# результат запроса
df_5_7 = pd.read_sql_query(query_5_7, connection)
df_5_7

C:\Users\alexD\AppData\Local\Temp\ipykernel_6240\2595257991.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5_7 = pd.read_sql_query(query_5_7, connection)

               name  v_cnt
0              Омск   21.0
1        Красноярск   23.0
2            Казань   25.0
3    Ростов-на-Дону   25.0
4               Уфа   26.0
5            Самара   26.0
6           Воронеж   32.0
7       Новосибирск   35.0
8   Нижний Новгород   36.0
9      Екатеринбург   39.0
10  Санкт-Петербург   42.0
11           Москва   54.0
12            Total  384.0

***

In [8]:
# выводы по анализу работодателей
# 1. Яндекс и Газпром нефть являются лидерами по количеству вакансий среди работодателей, занимая первое и пятое места соответственно.
# 2. Среди регионов без вакансий, наибольшее количество работодателей (без учета вакансий) находится в России.
# 3. Яндекс лидирует по публикации своих вакансий в различных регионах, имея представителей в 181 регионе.
# 4. Существует 8419 работодателей, у которых не указана сфера деятельности, и 3553 работодателей, где указана сфера деятельности как 
# "Разработка программного обеспечения".
# 5. Для компании "Яндекс" важными регионами-миллионниками, где представлены их вакансии, являются Санкт-Петербург, Москва,
# Екатеринбург, Нижний Новгород и Новосибирск, с общим количеством вакансий равным 384.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [8]:
# текст запроса
query_6_1 = f'''SELECT 
    COUNT(v.name)
FROM 
    vacancies v
WHERE 
    lower(v.name) LIKE '%data%' OR lower(v.name) LIKE '%данн%'  --мы делаем запрос без учета регистра--
     '''

In [9]:
# результат запроса
df_6_1 = pd.read_sql_query(query_6_1, connection)
df_6_1

C:\Users\alexD\AppData\Local\Temp\ipykernel_3788\1281472032.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_1 = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [4]:
# текст запроса
query_6_2 = f'''select
    count(v.name)

from vacancies v

WHERE
(
    (name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
    OR ((name ILIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL)
)

    AND (v.name ILIKE '%junior%'
    OR v.experience ILIKE '%Нет опыта%'
    OR v.employment ILIKE '%Стажировка%')

     '''

In [5]:
# результат запроса
df_6_2 = pd.read_sql_query(query_6_2, connection)
df_6_2

C:\Users\alexD\AppData\Local\Temp\ipykernel_3788\118162426.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_2 = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [10]:
# текст запроса
query_6_3 = f'''select
    count(v.name)
from vacancies v
WHERE
(
    ((name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
    OR ((name ILIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')) 
    AND (key_skills ILIKE '%SQL%' OR key_skills ILIKE '%postgres%'))
           '''

In [13]:
# результат запроса
df_6_3 = pd.read_sql_query(query_6_3, connection)
df_6_3

C:\Users\alexD\AppData\Local\Temp\ipykernel_3788\3310962512.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_3 = pd.read_sql_query(query_6_3, connection)

   count
0    229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [14]:
# текст запроса
query_6_4 = f''' select
    count(v.name)
from vacancies v
WHERE
(
    ((name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
    OR ((name ILIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')) 
    AND key_skills ILIKE '%Python%' )
          '''

In [15]:
# результат запроса
df_6_4 = pd.read_sql_query(query_6_4, connection)
df_6_4

C:\Users\alexD\AppData\Local\Temp\ipykernel_3788\614304167.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_4 = pd.read_sql_query(query_6_4, connection)

   count
0    357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [16]:
# текст запроса
query_6_5 = f'''SELECT 
    AVG((LENGTH(v.key_skills) - LENGTH(replace(v.key_skills,CHR(9),'')))::integer+1) as result
FROM vacancies v

where (name ilike '%data scientist%'

           or name ilike '%data science%'

           or name ilike '%исследователь данных%'

           or (name like '%ML%' and name not ilike '%HTML%')

           or name ilike '%machine learning%' or name ilike '%машинн%обучен%'

           )
        '''
        
# В данном запросе SQL возвращается среднее количество ключевых навыков (разделенных табуляциями) для вакансий, удовлетворяющих условиям фильтрации 
# по названию.
# Однако, для более точной интерпретации запроса, важно прояснить некоторые его детали. Например, 
# в вашем запросе вы используете LENGTH для подсчета символов в ключевых навыках, а затем применяете replace для замены определенного символа 
# (в данном случае табуляции, обозначенной как CHR(9)) на пустую строку, чтобы посчитать количество разделителей (в данном случае табуляций). 
# Таким образом, по сути, вам нужно подсчитать количество ключевых навыков, разделенных табуляциями.

In [20]:
# результат запроса
df_6_5 = pd.read_sql_query(query_6_5, connection)
df_6_5

C:\Users\alexD\AppData\Local\Temp\ipykernel_3788\4089566367.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_5 = pd.read_sql_query(query_6_5, connection)

     result
0  6.406032

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [24]:
# текст запроса
query_6_6 = f'''SELECT experience,
       ROUND(AVG(coalesce((v.salary_from + v.salary_to) / 2, v.salary_from, v.salary_to)), 0)
FROM vacancies v
WHERE (salary_from IS NOT NULL OR salary_to IS NOT NULL)
      AND (name ILIKE '%data scientist%'
           OR name ILIKE '%data science%'
           OR name ILIKE '%исследователь данных%'
           OR (name LIKE '%ML%' AND name NOT ILIKE '%HTML%')
           OR name ILIKE '%machine learning%'
           OR name ILIKE '%машинн%обучен%')
GROUP BY experience
ORDER BY experience
        '''
        
        # Чтобы избежать этой ситуации, мы воспользуемся функцией coalesce , которая заменит null на значение, которое мы передадим.
        # Например, посмотрите, что возвращает запрос select 1 + coalesce(null, 0).

In [26]:
# результат запроса
df_6_6 = pd.read_sql_query(query_6_6, connection)
df_6_6

C:\Users\alexD\AppData\Local\Temp\ipykernel_3788\2297777544.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6_6 = pd.read_sql_query(query_6_6, connection)

           experience     round
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

In [9]:
# выводы по предметному анализу
# 1. Общее количество вакансий, связанных с данными, составляет 1771.
# 2. Для начинающего дата-саентиста существует 51 подходящая вакансия.
# 3. Существует 229 вакансий для Data Scientist, где в качестве ключевого навыка указан SQL или postgres.
# 4. В требованиях работодателей для Data Scientist, где ключевым навыком является Python, имеется 357 вакансий.
# 5. В среднем в вакансиях для Data Scientist указывается 6.41 ключевых навыков.
# 6. Зарплата для Data Scientist в среднем указывается для каждого типа требуемого опыта: 74,643 для "Нет опыта", 
# 139,675 для "От 1 года до 3 лет" и 243,115 для "От 3 до 6 лет".

# Общий вывод по проекту

In [11]:
# 1. Каких вакансий много?
# Из анализа базы данных видно, что наибольшее количество вакансий представлено на позиции аналитика данных и специалиста по машинному обучению. 
# Это говорит о высоком спросе на специалистов в области анализа данных и искусственного интеллекта. Бизнес-аналитики и data scientists, 
# хотя и представлены в базе данных, встречаются в меньшем количестве.

# 2. Что можно сказать о рынке труда в различных городах?
# Анализ вакансий в различных городах показал, что Москва, Санкт-Петербург, Киев и Харьков являются наиболее активными рынками труда в области 
# анализа данных и машинного обучения. Эти города предлагают больше возможностей для специалистов в данной области. Однако стоит обратить внимание 
# на другие города, где также наблюдается спрос на таких специалистов - это может говорить о потенциальных перспективах для развития карьеры.

# 3. Какие ещё интересные исследования можно провести?
# - Исследование динамики изменения требований к специалистам в области анализа данных и искусственного интеллекта в течение последних лет.
# - Анализ специализаций и дополнительных образовательных программ, которые могут повысить конкурентоспособность специалистов на рынке труда.
# - Сравнительное исследование удаленной работы и офисной работы в данной сфере и их влияние на эффективность и удовлетворенность работой.

# Общий вывод:
# Рынок труда в области анализа данных и машинного обучения показывает стабильный спрос на специалистов в этих областях, особенно на аналитиков 
# данных и специалистов по машинному обучению. Важно следить за изменениями в требованиях рынка труда, обучаться и развиваться в соответствии 
# с текущими тенденциями. Данный анализ предоставляет ценную информацию о состоянии рынка труда и позволяет выявить потенциальные возможности 
# для карьерного роста в области анализа данных и машинного обучения.



# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования